Revit 2027 API
View.RestoreCalloutParent Method
 Restores callout parent ID to the original view ID if that view is still available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RestoreCalloutParent()
Public Sub RestoreCalloutParent
public:
void RestoreCalloutParent()
member RestoreCalloutParent : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This view is not a callout.
Remarks
 Nothing is done if the callout already has parent or if the original callout parent is deleted or is not parallel to the callout view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace